# DigitalChefBot v1.0 — стартовая версия
# Реагирует только на команду /start

import telebot

# 🔑 Вставьте сюда свой токен, полученный от BotFather
bot = telebot.TeleBot("8582135089:AAG87GAEukahGMUJWYLjipecMugUi_dDx0Q")

# Обработчик команды /start
@bot.message_handler(commands=['start'])
def start_cmd(message):
    first_name = message.from_user.first_name or "гость"
    bot.reply_to(
        message,
        f"👨‍🍳 Привет, {first_name}! Добро пожаловать в BubaBurger — ресторан будущего! 🍽️\n\n"
        f"Я крупнейший ресторан мира! Пока я только учусь, "
        f"но уже умею здороваться. Напишите /start ещё раз — я не устану 😉"
    )

@bot.message_handler(commands=["help"])
def help_cmd(message):
    bot.reply_to(
        message,
        "Доступные команды:\n"
        "/start — начать работу\n"
        "/help — справка\n"
        "/info — рассказ о боте"
    )

    
@bot.message_handler(commands=["info"])
def info_cmd(message):
    bot.reply_to(
        message,
        "Наша компания называется BUBA BURGER, вы можете заказывать бургеры на свой вкус!"
    )
@bot.message_handler(commands=["menu"])
def menu_cmd(message):
    bot.reply_to(
        message,
        "Доступные команды:\n"
        "У нас в меню есть:\n"
        "Чизбургер,\n" 
        " Двойной чизбургер,\n" 
        " Тройной чизбургер,\n" 
        " Четверной чизбургер,\n" 
        " Пятирной чизбургер,\n" 
        " Шестерной чизбургер,\n" 
        " Семерной чизбургер,\n" 
        " Восьмерной чизбургер,\n" 
        " Девятирной чизбургер,\n" 
        " Десятирной чизбургер,\n" 
        " Воппер,\n" 
        " Двойной воппер,\n" 
        " Танкобургер,\n" 
        " Десятирной танкобургер,\n" 
        " СССРбургер,\n" 
        " Двойной СССРбургер."
    )
@bot.message_handler(commands=["order"])
def order_cmd(message):
    text = message.text.strip()
    parts = text.split(maxsplit=1)
    if len(parts) == 1:
        bot.reply_to(message,"Что заказать?")
        return
    item = parts[1].strip()
    valid_items = {"чизбургер", "двойной чизбургер", "тройной чизбургер", "четверной чизбургер", "пятирной чизбургер", "шестерной чизбургер", "семерной чизбургер", "восьмерной чизбургер", "девятирной чизбургер", "десятирной чизбургер", "воппер", "двойной воппер", "танкобургер", "десятирной танкобургер", "сссрбургер", "двойной сссрбургер"}
    if item.lower() not in valid_items:
        bot.reply_to(message,
                     f"Не нашел «{item}» в меню. \nПосмотрите /menu и повторите заказ.")
        return
        bot.reply_to(message,
        f"Заказ оформлен: {item}. \nЕсли передумали - команда /cancel")
# Запускаем бесконечное прослушивание сообщений
bot.polling(non_stop=True)

